#coding: utf8

NEW_TO_OLD_CATE_CATEGORY = {
    u'居室门': u'门',
    u'安全门': u'门',
    u'移门壁柜': u'门',
    u'坐厕': u'马桶',
    u'塑钢窗': u'窗',
    u'浴缸': u'浴缸',
    u'浴室柜': u'浴室柜',
    u'龙头花洒': u'龙头花洒',
    u'浴室五金': u'地漏',
    u'开关插座': u'开关',
    u'灯具照明': u'集成电器',
    u'卫浴电器': u'集成电器',
    u'家居饰品': u'家装饰品',
    u'厨房电器': u'大家电',
    u'热水器': u'卫浴电器',
    u'床具': u'卧室家具',
    u'板式家具': u'定制家具',
    u'实木家具': u'定制家具',
    u'沙发': u'客厅家居',
    u'厨柜': u'橱柜',
    u'家居用品': u'浴室用品',
    u'净化除味': u'家居环保',
    u'家纺': u'床上用品'
}

CATEGORY_MAP = {
    u'门': u'居室门,安全门,移门壁柜',
    u'马桶': u'卫浴',
    u'窗': u'塑钢窗',
    u'浴缸': u'卫浴',
    u'地漏': u'卫浴',
    u'龙头花洒': u'卫浴',
    u'浴室柜': u'卫浴',
    u'开关': u'开关插座',
    u'集成电器': u'灯具照明,卫浴电器',
    u'大家电': u'厨房电器',
    u'浴室用品': u'家居用品',
    u'家装饰品': u'家居饰品',
    u'卧室家具': u'床具',
    u'定制家具': u'板式家具,实木家具',
    u'客厅家居': u'沙发',
    u'橱柜': u'厨柜',
    u'灯具': u'灯具照明',
    u'生活电器': u'厨房电器,卫浴电器',
    u'餐厅家具': u'板式家具,实木家具,欧美家具',
    u'办公家具': u'板式家具,实木家具,欧美家具',
    u'书房家具': u'板式家具,实木家具,欧美家具',
    u'坐厕': u'卫浴',
    u'洁身器': u'卫浴',
    u'面盆': u'卫浴',
    u'消毒柜': u'厨房电器',
    u'洗碗机': u'厨房电器',
    u'烤箱': u'厨房电器',
    u'浴霸': u'卫浴电器',
    u'家居环保': u'净化除味',
    u'家纺': u'床上用品'
}

phone_list = ['139', '188', '185', '136', '158', '151', '131', '132', '186', '189']

